In [29]:
import pandas as pd

In [90]:
# The data source is from Malaysia DOSM (https://data.gov.my/data-catalogue/births)
URL_DATA = 'https://storage.data.gov.my/demography/births.parquet'

# Extract data from source
df = pd.read_parquet(URL_DATA)

print(df.head())

         date     state  births
0  1920-01-01  Malaysia      96
1  1920-01-02  Malaysia     115
2  1920-01-03  Malaysia     111
3  1920-01-04  Malaysia     101
4  1920-01-05  Malaysia      95

In [136]:
df.head()
df.tail()

            date     state  births month_name
37828 2023-07-27  Malaysia    1199       July
37829 2023-07-28  Malaysia    1220       July
37830 2023-07-29  Malaysia     927       July
37831 2023-07-30  Malaysia     938       July
37832 2023-07-31  Malaysia    1098       July

In [137]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37833 entries, 0 to 37832
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        37833 non-null  datetime64[ns]
 1   state       37833 non-null  object
 2   births      37833 non-null  int64
 3   month_name  37833 non-null  object
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 1.2+ MB

In [93]:
# Task 1: Based on the lesson learned previously, convert the "DATE" column data type into datetime format
df['date']= pd.to_datetime(df['date'],format= '%m/%d/%Y %I:%M:%S %p')

In [94]:
df.head()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37833 entries, 0 to 37832
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    37833 non-null  datetime64[ns]
 1   state   37833 non-null  object
 2   births  37833 non-null  int64
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 886.8+ KB

In [95]:
df['date'].dt.month_name()

0        January
1        January
2        January
3        January
4        January
          ...
37828       July
37829       July
37830       July
37831       July
37832       July
Name: date, Length: 37833, dtype: object

In [97]:
df['month_name']= df['date'].dt.month_name()

In [98]:
df.head()

        date     state  births month_name
0 1920-01-01  Malaysia      96    January
1 1920-01-02  Malaysia     115    January
2 1920-01-03  Malaysia     111    January
3 1920-01-04  Malaysia     101    January
4 1920-01-05  Malaysia      95    January

In [135]:
df.sample(7)

            date     state  births month_name
30733 2004-02-22  Malaysia    1235   February
32585 2009-03-19  Malaysia    1543      March
12095 1953-02-11  Malaysia     580   February
15585 1962-09-02  Malaysia    1007  September
35741 2017-11-08  Malaysia    1562   November
6005  1936-06-10  Malaysia     357       June
663   1921-10-25  Malaysia     113    October

In [126]:
month_count= df['month_name'].value_counts()
print(month_count)

month_name
January      3224
March        3224
May          3224
July         3224
August       3193
October      3193
December     3193
April        3120
June         3120
September    3090
November     3090
February     2938
Name: count, dtype: int64

In [160]:
month_count= df['month_name'].sum
print(month_count)

<bound method Series.sum of 0        January
1        January
2        January
3        January
4        January
          ...
37828       July
37829       July
37830       July
37831       July
37832       July
Name: month_name, Length: 37833, dtype: object>

In [169]:
df_new= df.groupby(['month_name']).agg(avg_birth=('births','mean'))

In [170]:
df_new

             avg_birth
month_name
April       945.387500
August      951.493893
December    951.100846
February    904.976515
January     928.116935
July        946.085608
June        960.348718
March       926.428970
May         959.320099
November    963.218123
October     985.878171
September   981.742071

In [172]:
#df_new.to_csv('birth_transform1.csv', index=True)

In [174]:
avg_births_month= df.groupby('month_name')['births'].mean().reset_index()

In [175]:
print(avg_births_month)

   month_name      births
0       April  945.387500
1      August  951.493893
2    December  951.100846
3    February  904.976515
4     January  928.116935
5        July  946.085608
6        June  960.348718
7       March  926.428970
8         May  959.320099
9    November  963.218123
10    October  985.878171
11  September  981.742071

In [177]:
avg_births_month.to_csv('birth_transform2.csv', index=False)

In [ ]:
# Task 2a: Extract the Month name (e.g. January/February/March etc) into another column called "MONTH_NAME"
# Then get average of births aggregate/group by MONTH_NAME
# The expected dataframe is something like this:

# |----------------|-----------|
# |MONTH_NAME      | AVG_BIRTH |
# |----------------|-----------|
# |JANUARY XXX     |           |
# |FEBRUARY XXX    |           |
# |MARCH XXX       |           |
#   .....           

...

In [ ]:
# Task 2b: Save the aggregated dataframe in task 2a above into CSV file without index (index=False) in the same folder as this file
# The filename shall be your nickname + _avg_birth_by_month.csv
# Example: azhar_avg_birth_by_month.csv
# No space is allowed. But make sure your nickname is recognizable for evaluation.

...

In [13]:
# Task 3a: Create a dataframe to calculate average birth by the following generation group:
# --> Silent Generation - from 1928 to 1945 included
# --> Baby Boomers - from 1946 to 1964 included
# --> Gen X - from 1965 to 1980 included
# --> Gen Y - from 1981 to 1996 included
# The expected dataframe is something like this:

# |----------------|-----------|
# |GENERATION      | AVG_BIRTH |
# |----------------|-----------|
# |Gen X           |           |
# |Gen Y           |           |
# ......

# Hint: Use for-loop and if/else

...

In [211]:
generation_groups = {
    'Silent Generation': [],
    'Baby Boomers': [],
    'Gen X': [],
    'Gen Y': []}

In [212]:
for index, row in df.iterrows():
    if row['date'].year >= 1928 and row['date'].year <= 1945:
        generation_groups['Silent Generation'].append(row['births'])
    elif row['date'].year >= 1946 and row['date'].year <= 1964:
        generation_groups['Baby Boomers'].append(row['births'])
    elif row['date'].year >= 1965 and row['date'].year <= 1980:
        generation_groups['Gen X'].append(row['births'])
    elif row['date'].year >= 1981 and row['date'].year <= 1996:
        generation_groups['Gen Y'].append(row['births'])

In [213]:
average_births_by_generation = {}
for generation, births in generation_groups.items():
    average_births_by_generation[generation] = sum(births) / len(births) if births else 0

In [215]:
average_births_df = pd.DataFrame(list(average_births_by_generation.items()), columns=['generation', 'avg_birth'])

print(average_births_df)

          generation    avg_birth
0  Silent Generation   319.764259
1       Baby Boomers   764.404899
2              Gen X  1057.826318
3              Gen Y  1417.433778

In [216]:
average_births_df.to_csv('birth_transform3.csv', index=False)

In [14]:
# Task 3b: Save the aggregated dataframe in task 3a above into CSV file without index (index=False) in the same folder as this file
# The filename shall be your nickname + _avg_birth_by_generation.csv
# Example: azhar_avg_birth_by_generation.csv
# No space is allowed. But make sure your nickname is recognizable for evaluation.

...